package com.example.cininfo.data

import com.example.cininfo.R

object FilmList {

    fun getFreshFilmsLocal() = listOf(
        FilmData(
            "Белая ворона: эпилог",
            "Insecure: The End",
            "2021",
            "США",
            "Фильм, рассказывающий о создании сериала «Белая ворона». После пяти успешных сезонов съемочная группа вспоминает самые ударные моменты и размышляет о вкладе проекта в поп-культуру.",
            R.drawable.small_belaya_vorona_epilog_2021,
            R.drawable.big_belaya_vorona_epilog_2021
        ),
        FilmData(
            "Магазинные воришки всего мира",
            "Shoplifters of the World",
            "2021",
            "США",
            "Денвер, 1987 год. Узнав о распаде любимой группы The Smiths, компания молодых людей устраивает в честь своих кумиров безумную вечеринку. Но один из парней идет еще дальше: вооруженный пистолетом, он захватывает в заложники персонал Денверской радиостанции.",
            R.drawable.small_magazinnye_vorishki_vsego_mira_2021,
            R.drawable.big_magazinnye_vorishki_vsego_mira_2021
        ),
        FilmData(
            "Мужские слзёзы",
            "Cry Macho",
            "2021",
            "США",
            "После того как жену с ребенком конезаводчика и победителя Кентуккийского дерби по имени Майк убили, он впал в депрессию, заливая горе алкоголем. Однажды инвестор предлагает Майку выбор: либо уволиться, либо вернуть ему сына, который живет с бывшей женой в Мексике.",
            R.drawable.small_muzhskie_slezy_2021,
            R.drawable.big_muzhskie_slezy_2021
        ),
        FilmData(
            "Поступь хаоса",
            "Chaos Walking",
            "2021",
            "США, Канада, Гонконг, Люксембург",
            "2257 год. Родина Тодда Хьюитта — колонизированная планета Новый Мир, где мысли мужчин имеют визуально-звуковое воплощение и называются шумом. Парень живёт в небольшой деревне, населённой исключительно мужчинами, и ещё не научился скрывать свои мысли от окружающих. Однажды над планетой терпит крушение корабль-разведчик из второй волны колонистов, в результате чего Тодд впервые в сознательной жизни видит девушку. Местный мэр решает использовать её в своих коварных планах, но девушка сбегает, и теперь без помощи Тодда ей не обойтись.",
            R.drawable.small_postup_haosa_2021,
            R.drawable.big_postup_haosa_2021
        ),
        FilmData(
            "Шоу андроидов",
            "R.I.A.",
            "2021",
            "Великобритания",
            "Риа снова и снова переживает один и тот же день: по утрам она просыпается рядом со своим мужем Джеком, но каждый раз это другой мужчина. Ведь она — андроид. Она живет идеальной жизнью домохозяйки, пока однажды ей всё не надоедает. Риа решает сбежать из дома, взяв очередного Джека в заложники.",
            R.drawable.small_shou_androidov_2021,
            R.drawable.big_shou_androidov_2021
        ),
        FilmData(
            "Те, кто желает мне смерти",
            "Those Who Wish Me Dead",
            "2021",
            "Канада, США",
            "Бывшая руководительница бригады пожарных Ханна уже год не может пережить гибель подчинённого во время лесного пожара, а также трёх случайно оказавшихся на местности мальчишек. Теперь её рабочее место — наблюдательная вышка в лесах Монтаны. А в это время обычный бухгалтер, недавно узнавший компрометирующую важных людей информацию, скрывается от киллеров. Вместе с 12-летним сыном он мчит на машине в те же монтанские леса, где брат его покойной жены работает шерифом.",
            R.drawable.small_te_kto_zhelaet_mne_smerti_2021,
            R.drawable.big_te_kto_zhelaet_mne_smerti_2021
        ),
        FilmData(
            "Три семьи",
            "Tre piani",
            "2021",
            "Италия, Франция",
            "История трех семей, живущих в одном буржуазном кондоминиуме.",
            R.drawable.small_tri_semi_2021,
            R.drawable.big_tri_semi_2021
        )
    )

    fun getPopularFilmsLocal() = listOf(
        FilmData(
            "Форрест Гамп",
            "Forrest Gump",
            "1994",
            "США",
            "Сидя на автобусной остановке, Форрест Гамп — не очень умный, но добрый и открытый парень — рассказывает случайным встречным историю своей необыкновенной жизни. С самого малолетства он страдал от заболевания ног, и соседские хулиганы дразнили мальчика, и в один прекрасный день Форрест открыл в себе невероятные способности к бегу. Подруга детства Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись",
            R.drawable.small_forrest_gump_1994,
            R.drawable.big_forrest_gump_1994
        ),
        FilmData(
            "1+1",
            "Intouchables",
            "2011",
            "Франция",
            "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.",
            R.drawable.small_intouchables_2011,
            R.drawable.big_intouchables_2011
        ),
        FilmData(
            "Интерстеллар",
            "Interstellar",
            "2014",
            "Великобритания, Канада, США",
            "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
            R.drawable.small_interstellar_2014,
            R.drawable.big_interstellar_2014
        ),
        FilmData(
            "Побег из Шоушенка",
            "The Shawshank Redemption",
            "1994",
            "США",
            "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.",
            R.drawable.small_pobeg_iz_shoushenka_1994,
            R.drawable.big_pobeg_iz_shoushenka_1994
        ),
        FilmData(
            "Зелёная миля",
            "The Green Mile",
            "1999",
            "США",
            "Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.",
            R.drawable.small_zelenaya_milya_1999,
            R.drawable.big_zelenaya_milya_1999
        ),
        FilmData(
            "Властелин колец. Братство кольца",
            "The Lord of the Rings: The Fellowship of the Ring",
            "2001",
            "Новая Зеландия, США",
            "Тихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад. Это кольцо принадлежало когда-то темному властителю Средиземья Саурону, и оно дает большую власть своему обладателю. Теперь Саурон хочет вернуть себе власть над Средиземьем. Бильбо отдает Кольцо племяннику Фродо, чтобы тот отнёс его к Роковой Горе и уничтожил.",
            R.drawable.small_vk_bratstvo_kolca_2001,
            R.drawable.big_vk_bratstvo_kolca_2001
        ),
        FilmData(
            "Властелин колец. Две крепости",
            "The Lord of the Rings: The Two Towers",
            "2002",
            "Новая Зеландия, США",
            "Братство распалось, но Кольцо Всевластья должно быть уничтожено. Фродо и Сэм вынуждены доверится Голлуму, который взялся провести их к вратам Мордора. Громадная армия Сарумана приближается: члены братства и их союзники готовы принять бой. Битва за Средиземье продолжается.",
            R.drawable.small_vk_dve_kreposti_2002,
            R.drawable.big_vk_dve_kreposti_2002
        ),
        FilmData(
            "Властелин колец. Возвращение короля",
            "The Lord of the Rings: The Return of the King",
            "2003",
            "Новая Зеландия, США",
            "Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды. Он предвкушает близкую победу, но именно это мешает ему заметить две крохотные фигурки — хоббитов, приближающихся к Роковой Горе, где им предстоит уничтожить Кольцо Всевластья.",
            R.drawable.small_vk_vozvrashenie_korolya_2003,
            R.drawable.big_vk_vozvrashenie_korolya_2003
        )
    )
}